Tekla.Structures.AnalysisInternal.DotAnalysisEdge
The serialization structure for AnalysisEdge.

Tekla.Structures.AnalysisInternal.DotAnalysisEdge._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisEdge._Connectivity
The connectivity of the analysis edge.

Tekla.Structures.AnalysisInternal.DotAnalysisEdge._Radius
The radius of the analysis edge.

Tekla.Structures.AnalysisInternal.DotAnalysisEdge.ToStruct(Tekla.Structures.Analysis.AnalysisEdge)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisEdge.FromStruct(Tekla.Structures.Analysis.AnalysisEdge)
DO NOT USE! For internal usage only!
P: P.